; domain
(define (domain grid)
  (:requirements :strips)
  (:predicates
    ; types
    (place ?x)
    (key ?k)
    (shape ?s)
    ; static predicates
    (conn ?x ?y)
    (key-shape ?k ?s)
    (lock-shape ?x ?s)
    ; fluents
    (at ?k ?x)
    (at-robot ?x)
    (holding ?k)
    (arm-empty)
    (locked ?x)
    (open ?x)
  )

  ; move from ?curpos to adjacent ?nextpos that is open
  (:action move
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos)
                       (place ?nextpos)
                       (conn ?curpos ?nextpos)
                       (at-robot ?curpos)
                       (open ?nextpos))
    :effect (and (at-robot ?nextpos)
                 (not (at-robot ?curpos))))

  ; pick ?key that is at ?curpos when not holding another key
  (:action pickup
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos)
                       (key ?key)
                       (at ?key ?curpos)
                       (at-robot ?curpos)
                       (arm-empty))
    :effect (and (holding ?key)
                 (not (at ?key ?curpos))
                 (not (arm-empty))))

  ; pick ?newkey at ?curpos while holding/dropping ?oldkey (equiv. to putdown followed by pickup)
  (:action pickup-and-loose
    :parameters (?curpos ?newkey ?oldkey)
    :precondition (and (place ?curpos)
                       (key ?newkey)
                       (key ?oldkey)
                       (at ?newkey ?curpos)
                       (at-robot ?curpos)
                       (holding ?oldkey))
    :effect (and (holding ?newkey)
                 (at ?oldkey ?curpos)
                 (not (holding ?oldkey))
                 (not (at ?newkey ?curpos))))

  ; putdown ?key being held at ?curpos
  (:action putdown
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos)
                       (key ?key)
                       (at-robot ?curpos)
                       (holding ?key))
    :effect (and (arm-empty)
                 (at ?key ?curpos)
                 (not (holding ?key))))

  ; unlock ?lockpos adjacent to ?curpos using ?key begin held of matching ?shape
  (:action unlock
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos)
                       (place ?lockpos)
                       (key ?key)
                       (shape ?shape)
                       (conn ?curpos ?lockpos)
                       (key-shape ?key ?shape)
                       (lock-shape ?lockpos ?shape)
                       (at-robot ?curpos)
                       (locked ?lockpos)
                       (holding ?key))
    :effect (and (open ?lockpos)
                 (not (locked ?lockpos))))
)

; problem
(define (problem grid_2Vroom3_fpl_s3_seed17928_n0)
  (:domain grid)
  (:objects
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18
    shape0 shape1 shape2
    key0 key1 key2
  )
  (:init
    ; Object types
    (place p0) (place p1) (place p2) (place p3) (place p4) (place p5) (place p6) (place p7) (place p8) (place p9) (place p10) (place p11) (place p12) (place p13) (place p14) (place p15) (place p16) (place p17) (place p18)
    (shape shape0) (shape shape1) (shape shape2)
    (key key0) (key key1) (key key2)
    ; Open/locked cells
    (open p0) (open p1) (open p2) (open p3) (open p4) (open p5) (open p6) (open p7) (open p8) (open p10) (open p11) (open p12) (open p13) (open p14) (open p15) (open p16) (open p17) (open p18)
    (locked p9)
    ; Connected cells
    (conn p0 p1)
    (conn p0 p3)
    (conn p1 p0)
    (conn p1 p2)
    (conn p1 p4)
    (conn p2 p1)
    (conn p2 p5)
    (conn p3 p0)
    (conn p3 p4)
    (conn p3 p6)
    (conn p4 p3)
    (conn p4 p1)
    (conn p4 p5)
    (conn p4 p7)
    (conn p5 p4)
    (conn p5 p2)
    (conn p5 p8)
    (conn p6 p3)
    (conn p6 p7)
    (conn p6 p9)
    (conn p7 p6)
    (conn p7 p4)
    (conn p7 p8)
    (conn p8 p7)
    (conn p8 p5)
    (conn p9 p6)
    (conn p9 p10)
    (conn p10 p9)
    (conn p10 p11)
    (conn p10 p13)
    (conn p11 p10)
    (conn p11 p12)
    (conn p11 p14)
    (conn p12 p11)
    (conn p12 p15)
    (conn p13 p10)
    (conn p13 p14)
    (conn p13 p16)
    (conn p14 p13)
    (conn p14 p11)
    (conn p14 p15)
    (conn p14 p17)
    (conn p15 p14)
    (conn p15 p12)
    (conn p15 p18)
    (conn p16 p13)
    (conn p16 p17)
    (conn p17 p16)
    (conn p17 p14)
    (conn p17 p18)
    (conn p18 p17)
    (conn p18 p15)
    ; Lock and key shapes
    (lock-shape p9 shape0)
    (key-shape key0 shape0)
    (key-shape key1 shape1)
    (key-shape key2 shape2)
    ; Key placement
    (at key0 p16)
    (at key1 p6)
    (at key2 p11)
    ; Robot placement
    (at-robot p18)
    (arm-empty)
  )
  (:goal (at-robot p8))
)

; plan
1. (move p18 p17)
   deleted: (at-robot p18)
   added: (at-robot p17)
   goals met: 0 of 1
2. (move p17 p16)
   deleted: (at-robot p17)
   added: (at-robot p16)
   goals met: 0 of 1
3. (pickup p16 key0)
   deleted: (at key0 p16) (arm-empty)
   added: (holding key0)
   goals met: 0 of 1
4. (move p16 p13)
   deleted: (at-robot p16)
   added: (at-robot p13)
   goals met: 0 of 1
5. (move p13 p10)
   deleted: (at-robot p13)
   added: (at-robot p10)
   goals met: 0 of 1
6. (unlock p10 p9 key0 shape0)
   deleted: (locked p9)
   added: (open p9)
   goals met: 0 of 1
7. (move p10 p9)
   deleted: (at-robot p10)
   added: (at-robot p9)
   goals met: 0 of 1
8. (move p9 p6)
   deleted: (at-robot p9)
   added: (at-robot p6)
   goals met: 0 of 1
9. (move p6 p7)
   deleted: (at-robot p6)
   added: (at-robot p7)
   goals met: 0 of 1
10. (move p7 p8)
   deleted: (at-robot p7)
   added: (at-robot p8)
   goals met: 1 of 1
